Tekla.Structures.Analysis.AnalysisPartPositionProperties.LongitudinalOffsetEnum
The longitudinal offsets.

Tekla.Structures.Analysis.AnalysisPartPositionProperties.LongitudinalOffsetEnum.LONGITUDINAL_OFFSET_NONE
The longitudinal offset is "none".

Tekla.Structures.Analysis.AnalysisPartPositionProperties.LongitudinalOffsetEnum.LONGITUDINAL_OFFSET_EXTEND_ONLY
The longitudinal offset is "extend only".

Tekla.Structures.Analysis.AnalysisPartPositionProperties.LongitudinalOffsetEnum.LONGITUDINAL_OFFSET_ALWAYS
The longitudinal offset is "always".